class Haiku
  def initialize
    @items = [
'Луна-проводник
Зовет: "Загляни ко мне".
Дом у дороги.',

'Скучные дожди,
Сосны разогнали вас.
Первый снег в лесу.',

'Протянул ирис
Листья к брату своему.
Зеркало реки.',

'Снег согнул бамбук,
Словно мир вокруг него
Перевернулся.',

'Парят снежинки
Густою пеленою.
Зимний орнамент.',

'Полевой цветок
В лучах заката меня
Пленил на миг.',

'Вишни расцвели.
Не открыть сегодня мне
Тетрадь с песнями.',

'Веселье кругом.
Вишни со склона горы,
Вас не позвали?',

'Над вишней в цвету
Спряталась за облака
Скромница луна.',

'Тучи пролегли
Между друзьями. Гуси
Простились в небе.',

'Леса полоса
На склоне горы, словно
Пояс для меча.',

'Все, чего достиг?
На вершины гор, шляпу
Опустив, прилег.',

'Ветер со склонов
Фудзи в город забрать бы,
Как бесценный дар.',

'Долгий путь пройден,
За далеким облаком.
Сяду отдохнуть.',

'Взгляд не отвести -
Луна над горной грядой,
Родина моя.',

'Новогодние
Ели. Как короткий сон,
Тридцать лет прошло.',

'"Осень пришла!" -
Шепчет холодный ветер
У окна спальни.',

'Майские дожди.
Как моря огни, блестят
Стражи фонари.',

'Ветер и туман -
Вся его постель. Дитя
Брошено в поле.',

'На черной ветке
Ворон расположился.
Осенний вечер.',

'Добавлю в свой рис
Горсть душистой сон-травы
В ночь на Новый год.',

'Срез спиленного
Ствола вековой сосны
Горит, как луна.',

'Желтый лист в ручье.
Просыпайся, цикада,
Берег все ближе.',

'Свежий снег с утра.
Лишь стрелки лука в саду
Приковали взор.',

'Разлив на реке.
Даже у цапли в воде
Коротки ноги.',

'Для чайных кустов
Сборщица листа - словно
Ветер осени.',

'Горные розы,
С грустью глядят на вашу
Красу полевки.',

'В воде рыбешки
Играют, а поймаешь -
В руке растают.',

'Пальму посадил
И впервые огорчен,
Что взошел тростник.',

'Где ты, кукушка?
Привет передай весне
Сливы расцвели.',

'Взмах весла, ветер
И брызги холодных волн.
Слезы на щеках.',

'Одежда в земле,
Хоть и праздничный день у
Ловцов улиток.',

'Стон ветра в пальмах,
Грохот дождя слушаю
Ночи напролет.',

'Я - прост. Как только
Раскрываются цветы,
Ем на завтрак рис.',

'Ива на ветру.
Соловей в ветвях запел,
Как ее душа.',

'Пируют в праздник,
Но мутно мое вино
И черен мой рис.',

'После пожара
Лишь я не изменился
И дуб вековой.',

'Кукушки песня!
Напрасно перевелись
Поэты в наши дни.',

'Новый год, а мне
Только осенняя грусть
Приходит на ум.',

'На холм могильный
Принес не лотос святой,
А простой цветок.',

'Притихли травы,
Некому больше слушать
Шелест ковыля.',

'Морозная ночь.
Шорох бамбука вдали
Так меня влечет.',

'Выброшу в море
Свою старую шляпу.
Короткий отдых.',

'Обмолот риса.
В этом доме не знают
Голодной зимы.',

'Лежу и молчу,
Двери запер на замок.
Приятный отдых.',

'Хижина моя
Так тесна, что лунный свет
Все в ней озарит.',

'Язычок огня.
Проснешься - погас, масло
Застыло в ночи.',

'Ворон, погляди,
Где твое гнездо? Кругом
Сливы зацвели.',

'Зимние поля,
Бредет крестьянин, ищет
Первые всходы.',

'Крылья бабочек!
Разбудите поляну
Для встречи солнца.',

'Отдохни, корабль!
Персики на берегу.
Весенний приют.',

'Был пленен луной,
Но освободился. Вдруг
Тучка проплыла.',

'Как воет ветер!
Поймет меня лишь тот, кто
В поле ночевал.',

'К колокольчику
Цветку долетит ли комар?
Так грустно звенит.',

'Жадно пьет нектар
Бабочка-однодневка.
Осенний вечер.',

'Цветы засохли,
Но семена летят,
Как чьи-то слезы.',

'Ураган, листву
Сорвав, в роще бамбука
На время заснул.',

'Старый-старый пруд.
Вдруг прыгнула лягушка
Громкий всплеск воды.',

'Как ни белит снег,
А ветви сосны все равно
Зеленью горят.',

'Будь внимательным!
Цветы пастушьей сумки
На тебя глядят.',

'Храм Каннон. Горит
Красная черепица
В вишневом цвету.',

'Ты проснись скорей,
Стань товарищем моим,
Ночной мотылек!',

'Букетик цветов
Вернулся к старым корням,
На могилу лег.',

'Запад ли, Восток...
Везде холодный ветер
Студит мне спину.',

'Легкий ранний снег,
Только листья нарцисса
Чуть-чуть согнулись.',

'Вновь выпил вина,
А все никак не усну,
Такой снегопад.',

'Чайку качает,
Никак спать не уложит,
Колыбель волны.',

'Замерзла вода,
И лед разорвал кувшин.
Я проснулся вдруг.',

'Хочется хоть раз
В праздник сходить на базар
Купить табаку.',

'Глядя на луну,
Жизнь прошел легко, так и
Встречу Новый год.',

'Кто ж это, ответь,
В новогоднем наряде?
Сам себя не узнал.',

'Пастушок, оставь
Сливе последнюю ветвь,
Срезая хлысты.',

'Капуста легче,
Но корзины улиток
Разносит старик.',

'Помни, дружище,
Прячется в лесной глуши
Сливовый цветок.',

'Воробей, не тронь
Душистый бутон цветка.
Шмель уснул внутри.',

'Всем ветрам открыт
Аиста ночлег. Ветер,
Вишни зацвели.',

'Пустое гнездо.
Так и покинутый дом -
Выехал сосед.',

'Треснула бочка,
Майский дождь все льет.
Проснулся ночью.',

'Мать похоронив,
Друг все стоит у дома,
Смотрит на цветы.',

'Совсем исхудал,
И волосы отросли.
Долгие дожди.',

'Иду посмотреть:
Гнезда уток залили
Майские дожди.',

'Стучит и стучит
У домика лесного
Дятел-трудяга,',

'Светлый день, но вдруг -
Маленькая тучка, и
Дождь заморосил.',

'Сосновая ветвь
Коснулась воды - это
Прохладный ветер.',

'Прямо на ногу
Вдруг выскочил шустрый краб.
Прозрачный ручей.',

'В жару крестьянин
Прилег на цветы вьюнка.
Так же прост наш мир.',

'Спать бы у реки
Среди пьянящих цветов
Дикой гвоздики.',

'Он дыни растил
В этом саду, а ныне -
Холод вечера.',

'Ты свечу зажег.
Словно молнии проблеск,
В ладонях возник.',

'Луна проплыла,
Ветви оцепенели
В блестках дождевых.',

'Кустарник хаги,
Бездомную собаку
На ночь приюти.',

'Свежее жниво,
По полю цапля идет,
Поздняя осень.',

'Молотильщик вдруг
Остановил работу.
Там луна взошла.',

'Праздники прошли.
Цикады на рассвете
Все тише поют.',

'Вновь встают с земли
Опущенные дождем
Хризантем цветы.',

'Чернеют тучи,
Вот-вот прольются дождем
Только Фудзи бел.',

'Мой друг, весь в снегу,
С лошади упал - винный
Хмель свалил его.',

'В деревне приют
Всем хорош для бродяги.
Озимые взошли.',

'Верь в лучшие дни!
Деревце сливы верит:
Весной зацветет.',

'На огне из хвои
Высушу полотенце.
Снежный вихрь в пути.',

'Снег кружит, но ведь
В этом году последний
День полнолунья.',

'Персики цветут,
А я жду все не дождусь
Вишни цветенья.',

'В мой стакан с вином,
Ласточки, не роняйте
Комочки земли.',

'Двадцать дней счастья
Я пережил, когда вдруг
Вишни зацвели.',

'Прощайте, вишни!
Цветенье ваше мой путь
Теплом согреет.'
    ]
  end

  def get_random
    rand_index = Random.new.rand(@items.size)
    @items[rand_index]
  end

end